/***************************************************
 * Copyright © 2026 Sergey Chusov.
 * Version 1.0.0.
 * Licensed under CC BY-NC-ND 4.0
 * (Attribution-NonCommercial-NoDerivatives).
 * https://creativecommons.org/licenses/by-nc-nd/4.0
 * SPDX-License-Identifier: CC-BY-NC-ND-4.0
 ***************************************************/

//  ------------------- TODO ---------------------
// | Самостоятельно спроектируйте верификационное |
// | окружение контроллера прерываний.            |
//  ------------------- TODO ---------------------

// Топ-модуль простейшего верификационного
// окружения комбинационного контроллера
// прерываний.
module tb_irq_ctrl;

    //  -------------------- Важно! ---------------------
    // | В качестве примера можно использовать модуль    |
    // | lesson_1/examples/03_fulladder/tb_fulladder.sv  |
    //  -------------------- Важно! ---------------------


endmodule
