/***************************************************
 * Copyright © 2026 Sergey Chusov.
 * Version 1.0.0.
 * Licensed under CC BY-NC-ND 4.0
 * (Attribution-NonCommercial-NoDerivatives).
 * https://creativecommons.org/licenses/by-nc-nd/4.0
 * SPDX-License-Identifier: CC-BY-NC-ND-4.0
 ***************************************************/

`timescale 1ns/1ps

// Топ-модуль верификационного окружения
// полного комбинационного сумматора.

//  ----------------- Важно! ------------------
// | Обратите внимание, что в данном окружении |
// | не производится проверок, а генерируются  |
// | только входные воздействия.               |
//  ----------------- Важно! ------------------

module tb_fulladder;

    // Определение проводов, которые будут
    // подключены к портам сумматора.
    // В большинстве случаев названия
    // этих проводов дублируют названия
    // портов.
    logic A_i;
    logic B_i;
    logic Cin_i;
    logic Cout_o;
    logic S_o;
    
    // Подключение модуля сумматора.
    fulladder DUT (
        .A_i    ( A_i    ),
        .B_i    ( B_i    ),
        .Cin_i  ( Cin_i  ),
        .Cout_o ( Cout_o ),
        .S_o    ( S_o    )
    );

    // Генерируем входные воздействия, ожидаем.

    //  ----------------- Важно! ------------------
    // | В данном модуле для генерации входных     |
    // | воздействий используется цикл for().      |
    // | Обратите внимание, что присвоение ко      |
    // | входам производится при помощи конкатена- |
    // | ции. Также выбор битов [2:0] можно не     |
    // | использовать, так как к выражению слева   |
    // | будет присовена младшая часть битов пере- |
    // | менной ~i~. Это определено в стандарте.   |
    // | Но! Явное лучше, чем неявное.             |
    //  ----------------- Важно! ------------------

    initial begin

        for(int i = 0; i < 8; i = i + 1) begin

            // Входные сигналы.
            {Cin_i, B_i, A_i} = i[2:0];

            // Ожидание.
            #20;

        end

        // Завершение.
        $finish();

    end

endmodule
