/***************************************************
 * Copyright © 2026 Sergey Chusov.
 * Version 1.0.0.
 * Licensed under CC BY-NC-ND 4.0
 * (Attribution-NonCommercial-NoDerivatives).
 * https://creativecommons.org/licenses/by-nc-nd/4.0
 * SPDX-License-Identifier: CC-BY-NC-ND-4.0
 ***************************************************/

// Топ-модуль простейшего верификационного
// окружения полного комбинационного сумматора.

//  -------------------- Важно! ---------------------
// | Особое внимание обратите на ожидание в 20ns     |
// | (20 наносекунд) перед проверкой выходных        |
// | значений. Попробуйте поменять 20ns на любое     |
// | другое значение. Можно попробовать, например,   |
// | 20ms (20 миллисекунд) или 1ps (1 пикосекунда).  |
// | Изменился ли результат симуляции?               |
//  -------------------- Важно! ---------------------

module tb_fulladder;

    // Определение проводов, которые будут
    // подключены к портам сумматора.
    // В большинстве случаев названия
    // этих проводов дублируют названия
    // портов.
    logic A_i;
    logic B_i;
    logic Cin_i;
    logic Cout_o;
    logic S_o;
    
    // Подключение модуля сумматора.
    fulladder DUT (
        .A_i    ( A_i    ),
        .B_i    ( B_i    ),
        .Cin_i  ( Cin_i  ),
        .Cout_o ( Cout_o ),
        .S_o    ( S_o    )
    );

    // Генерируем входные воздействия,
    // ожидаем, проверяем выходные
    // значения.
    initial begin

        // Входные сигналы.
        A_i   = 1'b0;
        B_i   = 1'b1;
        Cin_i = 1'b1;

        // Ожидание.
        #20ns;

        // Проверка.
        if( Cout_o !== 1'b1 ) begin
            $error("Invalid Cout_o! Real: %1b, Expected: %1b", Cout_o, 1'b1);
        end
        if( S_o !== 1'b0 ) begin
            $error("Invalid S_o! Real: %1b, Expected: %1b", S_o, 1'b0);
        end

        // Завершение.
        $finish();

    end

endmodule
