/***************************************************
 * Copyright © 2026 Sergey Chusov.
 * Version 1.0.0.
 * Licensed under CC BY-NC-ND 4.0
 * (Attribution-NonCommercial-NoDerivatives).
 * https://creativecommons.org/licenses/by-nc-nd/4.0
 * SPDX-License-Identifier: CC-BY-NC-ND-4.0
 ***************************************************/

// Топ-модуль верификационного окружения
// полного комбинационного сумматора.

//  ----------------- Важно! ------------------
// | Обратите внимание, что в данном окружении |
// | не производится проверок, а генерируются  |
// | только входные воздействия.               |
//  ----------------- Важно! ------------------

module tb_fulladder;

    // Определение проводов, которые будут
    // подключены к портам сумматора.
    // В большинстве случаев названия
    // этих проводов дублируют названия
    // портов.
    logic A_i;
    logic B_i;
    logic Cin_i;
    logic Cout_o;
    logic S_o;
    
    // Подключение модуля сумматора.
    fulladder DUT (
        .A_i    ( A_i    ),
        .B_i    ( B_i    ),
        .Cin_i  ( Cin_i  ),
        .Cout_o ( Cout_o ),
        .S_o    ( S_o    )
    );

    // Генерируем входные воздействия, ожидаем.
    initial begin

        // Входные сигналы.
        A_i   = 1'bx;
        B_i   = 1'bx;
        Cin_i = 1'bx;

        // Ожидание.
        #20ns;

        // Входные сигналы.
        A_i   = 1'b0;
        B_i   = 1'b0;
        Cin_i = 1'b0;

        // Ожидание.
        #20ns;

        // Входные сигналы.
        A_i   = 1'b1;
        B_i   = 1'b0;
        Cin_i = 1'b0;

        // Ожидание.
        #20ns;

        // Входные сигналы.
        A_i   = 1'b0;
        B_i   = 1'b1;
        Cin_i = 1'b0;

        // Ожидание.
        #20ns;

        // Входные сигналы.
        A_i   = 1'b1;
        B_i   = 1'b1;
        Cin_i = 1'b0;

        // Ожидание.
        #20ns;

        // Входные сигналы.
        A_i   = 1'b0;
        B_i   = 1'b0;
        Cin_i = 1'b1;

        // Ожидание.
        #20ns;

        // Входные сигналы.
        A_i   = 1'b1;
        B_i   = 1'b0;
        Cin_i = 1'b1;

        // Ожидание.
        #20ns;

        // Входные сигналы.
        A_i   = 1'b0;
        B_i   = 1'b1;
        Cin_i = 1'b1;

        // Ожидание.
        #20ns;

        // Входные сигналы.
        A_i   = 1'b1;
        B_i   = 1'b1;
        Cin_i = 1'b1;

        // Ожидание.
        #20ns;

        // Завершение.
        $display("OK");
        $finish();

    end

initial begin
  $dumpfile("wave.vcd");
  $dumpvars(0, tb_fulladder);
end

endmodule
