/***************************************************
 * Copyright © 2026 Sergey Chusov.
 * Version 1.0.0.
 * Licensed under CC BY-NC-ND 4.0
 * (Attribution-NonCommercial-NoDerivatives).
 * https://creativecommons.org/licenses/by-nc-nd/4.0
 * SPDX-License-Identifier: CC-BY-NC-ND-4.0
 ***************************************************/

`timescale 1ns/1ps

// Топ-модуль верификационного окружения
// полного комбинационного сумматора.

//  ----------------- Важно! ------------------
// | Обратите внимание, что в данном окружении |
// | не производится проверок, а генерируются  |
// | только входные воздействия.               |
//  ----------------- Важно! ------------------

module tb_fulladder;

    // Определение проводов, которые будут
    // подключены к портам сумматора.
    // В большинстве случаев названия
    // этих проводов дублируют названия
    // портов.
    logic A_i;
    logic B_i;
    logic Cin_i;
    logic Cout_o;
    logic S_o;
    
    // Подключение модуля сумматора.
    fulladder DUT (
        .A_i    ( A_i    ),
        .B_i    ( B_i    ),
        .Cin_i  ( Cin_i  ),
        .Cout_o ( Cout_o ),
        .S_o    ( S_o    )
    );

    // Генерируем входные воздействия, ожидаем.

    //  ----------------- Важно! -------------------
    // | В данном модуле для генерации входных      |
    // | воздействий используется цикл while().     |
    // | Обратите внимание, что переменная, значе-  |
    // | ние которой будет присвоено ко входам      |
    // | сумматора, объявляется отдельно, т.к. у    |
    // | repeat() нет явного итератора. Также       |
    // | обратите внимание на явное условие выхода: |
    // | переменная ~i~ меньше 8.                   |
    //  ----------------- Важно! -------------------

    initial begin

        // Переменная-счетчик для подачи входного
        // воздействия, т.к. у while нет итератора.
        int i;

        while(i < 8) begin

            // Входные сигналы.
            {Cin_i, B_i, A_i} = i[2:0];

            // Ожидание.
            #20;

            // Инкремент.
            i = i + 1;

        end

        // Завершение.
        $finish();

    end

endmodule
