/***************************************************
 * Copyright © 2026 Sergey Chusov.
 * Version 1.0.0.
 * Licensed under CC BY-NC-ND 4.0
 * (Attribution-NonCommercial-NoDerivatives).
 * https://creativecommons.org/licenses/by-nc-nd/4.0
 * SPDX-License-Identifier: CC-BY-NC-ND-4.0
 ***************************************************/

`timescale 1ns/1ps

// Топ-модуль верификационного окружения
// последовательностного сумматора.

//  ------------------ Важно! -------------------
// | Внимательно изучите данное окружение. При   |
// | помощи его изучения вы ознакомитесь с TBV   |
// | методом верификации последовательностной    |
// | логики, который обеспечивает достаточный    |
// | уровень абстракции для верификации простей- |
// | ших последовательностных модулей.           |
//  ------------------ Важно! -------------------

//  ------------------ Важно! -------------------
// | Обратите внимание на условие завершения     |
// | тирования. Для направленных сценариев оно   |
// | часто может быть описано вполне конкретно,  |
// | т.к. известно последнее значение (или пос-  |
// | ледовательность значений во времени), кото- |
// | рое должно быть проверено.                  |
//  ------------------ Важно! -------------------

module tb_fulladder_sync;

    // Параметр для периода тактового
    // сигнала.
    parameter CLK_PERIOD = 10;

    // Определение тактового сигнала и
    // сигнала сброса.
    logic clk_i;
    logic areset_i;

    // Определение проводов, которые будут
    // подключены к портам сумматора.
    logic A_i;
    logic B_i;
    logic Cin_i;
    logic Cout_o;
    logic S_o;
    
    // Подключение тестируемого модуля.
    fulladder_sync DUT (
        .clk_i    ( clk_i    ),
        .areset_i ( areset_i ),
        .A_i      ( A_i      ),
        .B_i      ( B_i      ),
        .Cin_i    ( Cin_i    ),
        .Cout_o   ( Cout_o   ),
        .S_o      ( S_o      )
    );

    // Генерация тактового сигнала.
    initial begin
        clk_i <= 1'b0;
        forever begin
            #(CLK_PERIOD/2) clk_i = ~clk_i;
        end
    end

    // Генерация сигнала сброса.
    initial begin
        areset_i <= 1'b1;
        @(posedge clk_i);
        @(negedge clk_i);
        areset_i = 1'b0;
    end

    // Структура, которая будет передаваться между
    // компонентами окружения. Будет служить "контейнером"
    // для отправки данных между генератором и драйвером,
    // а также между монитором и проверкой.
    typedef struct {
        logic A;
        logic B;
        logic Cin;
        logic Cout;
        logic S;
    } packet_s;

    // Mailbox между генератором и драйвером.

    //  ---------------- Важно! ------------------
    // | Обратите внимание на размер mailbox,     |
    // | он вмещает всего 1 пакет. До того, как   |
    // | драйвер не заберет пакет из ящика, ге-   |
    // | нератор не сможет положить в него новый. |
    // | Почтовый ящик не делается бесконечным    |
    // | во избежание отправки в него всех паке-  |
    // | тов в нулевой момент времени и их хране- |
    // | ния там на протяжении всей симуляции     |
    //  ---------------- Важно! ------------------

    mailbox#(packet_s) gen2drv = new(1);

    // Mailbox между монитором и проверкой.
    mailbox#(packet_s) mon2scb = new();

    // Генератор.
    // Данный процесс отвечает за то, КАКИЕ данные
    // будут выставлены на входы тестируемого
    // устройства.

    //  ---------------- Важно! ----------------
    // | Генератор создает полезные данные, он  |
    // | никогда не взаимодействует с портами   |
    // | устройства, тактовым сигналом или сиг- |
    // | налом сброса. Да, верификация данного  |
    // | модуля осуществляется исключительно    |
    // | направленным сценарием.                |
    //  ---------------- Важно! ----------------

    initial begin
        packet_s p;
        for(int i = 0; i < 8; i = i + 1) begin
            {p.A, p.B, p.Cin} = i[2:0];
            gen2drv.put(p);
        end
    end

    // Драйвер.
    // Данный процесс отвечает за то, КАК данные
    // попадут в тестируемое устройство.
    
    //  --------------------- Важно! ---------------------
    // | Драйвер имитирует поведение последовательностной |
    // | логики, реагирует на сигнал сброса и тактовый    |
    // | сигнал.                                          |
    //  --------------------- Важно! ---------------------

    initial begin

        packet_s p;

        // Ожидание активного уровня сигнала сброса.
        wait(areset_i === 1'b1);

        // Сброс входных сигналов.
        // Обратите внимание на
        // неблокирующие присваивания.
        A_i   <= 1'b0;
        B_i   <= 1'b0;
        Cin_i <= 1'b0;

        // Ожидание неактивного уровня сигнала сброса.
        wait(areset_i === 1'b0);

        // Получение пакета от генератора и выставление.
        forever begin
            @(posedge clk_i);
            gen2drv.get(p);
            A_i   <= p.A;
            B_i   <= p.B;
            Cin_i <= p.Cin;
        end

    end

    // Монитор.
    // Поток отвечает за сбор информации об изменении
    // значений на портах устройства во времени.

    //  ------------------- Важно! ---------------------
    // | Процесс реагирует на сигнал сброса и тактовый  |
    // | сигнал.                                        |
    //  ------------------- Важно! ---------------------

    initial begin

        packet_s p;

        // Ожидание активного уровня сигнала сброса.
        wait(areset_i === 1'b1);
        // Ожидание неактивного уровня сигнала сброса.
        wait(areset_i === 1'b0);

        // Мониторинг.
        forever begin
            @(posedge clk_i);
            p.A    = A_i;
            p.B    = B_i;
            p.Cin  = Cin_i;
            p.Cout = Cout_o;
            p.S    = S_o;
            mon2scb.put(p);
        end

    end

    // Проверка.
    // Данный процесс отвечает за получение информации
    // от монитора и проверки соответствия работы
    // тестируемого устройства спецификации.
    initial begin

        // Пакет с предыдущего такта ~p_prev~ и пакет с
        // текущего такта ~p_cur~.
        packet_s p_prev, p_cur;

        // Переменная эталонного значения
        logic [1:0] sum;

        // Получаем пакет.
        mon2scb.get(p_prev);
        forever begin
            // Получаем еще 1 пакет.
            // Теперь в переменной ~p_cur~ содержится
            // пакет текущего такта, а в переменной
            // ~p_prev~ пакет с прошлого такта.
            mon2scb.get(p_cur);
            // Вычисляем эталонное значение для входов
            // с предыдущего такта.
            sum = p_prev.A + p_prev.B + p_prev.Cin;
            // Сравниваем эталонное значение со значением
            // со входов текущего такта.
            if( sum !== {p_cur.Cout, p_cur.S} ) begin
                $error("Invalid {Cout_o, S_o}! Real: %2b ",
                     {Cout_o, S_o}, "Expected: %2b", sum);
            end
            // Выходим из бесконечного цикла, если эталонный
            // результат {Cout_o, S_o} равен 2'b11. Это простейшее
            // условие завершения, допустимое в рамках данного
            // окружения, т.к. последние входные значения, которые
            // мы хотим проверить, приведут к результату 2'b11.
            if( &sum ) break;
            // Если эталонный результат не равен 2'b11, то
            // текущий пакет становится предыдущим.
            p_prev = p_cur;
        end

        // Попадем сюда, если будет выполнен break
        // в бесконечном цикле выше. Завершение
        // симуляции.
        $finish();

    end

endmodule
