/***************************************************
 * Copyright © 2026 Sergey Chusov.
 * Version 1.0.0.
 * Licensed under CC BY-NC-ND 4.0
 * (Attribution-NonCommercial-NoDerivatives).
 * https://creativecommons.org/licenses/by-nc-nd/4.0
 * SPDX-License-Identifier: CC-BY-NC-ND-4.0
 ***************************************************/

`timescale 1ns/1ps

// Топ-модуль верификационного окружения
// модуля MAC (Multiply Accumulate).

//  ----------------- Важно! -------------------
// | Данное окружение реализует TBV метод +     |
// | constrained random подход к верификации.   |
// | Условием завершения является равенство     |
// | количества  проверенных пакетов количеству |
// | сгенерированных пакетов.                   |
//  ----------------- Важно! -------------------

module tb_mac;

    // Параметр для периода тактового
    // сигнала.
    parameter CLK_PERIOD = 10;

    // Определение тактового сигнала и
    // сигнала сброса.
    logic clk_i;
    logic areset_i;

    // Определение проводов, которые будут
    // подключены к портам MAC.
    logic        clken_i;
    logic        load_i;
    logic [ 7:0] dataa_i;
    logic [ 7:0] datab_i;
    logic [15:0] out_o;
    logic        ovfl_o;
    
    // Подключение тестируемого модуля.
    mac DUT (
        .clk_i    ( clk_i    ),
        .areset_i ( areset_i ),
        .clken_i  ( clken_i  ),
        .load_i   ( load_i   ),
        .dataa_i  ( dataa_i  ),
        .datab_i  ( datab_i  ),
        .out_o    ( out_o    ),
        .ovfl_o   ( ovfl_o   )
    );

    // Генерация тактового сигнала.
    initial begin
        clk_i <= 1'b0;
        forever begin
            #(CLK_PERIOD/2) clk_i = ~clk_i;
        end
    end

    // Генерация сигнала сброса.
    initial begin
        areset_i <= 1'b1;
        @(posedge clk_i);
        @(negedge clk_i);
        areset_i = 1'b0;
    end

    // Структура, которая будет передаваться
    // между компонентами окружения. Будет служить
    // "контейнером" для отправки данных между
    // генератором и драйвером, а также между
    // монитором и проверкой.
    typedef struct {
             logic        clken;
        rand logic        load;
        rand logic [ 7:0] dataa;
        rand logic [ 7:0] datab;
        rand logic [15:0] out;
        rand logic        ovfl;
    } packet_s;

    // Mailbox между генератором и драйвером.
    mailbox#(packet_s) gen2drv = new(1);

    // Mailbox между монитором и проверкой.
    mailbox#(packet_s) mon2scb = new();

    // Количество пакетов, которые отправит генератор в
    // драйвер. Переменная используется двумя потоками:
    // генератором и проверкой.

    //  ------------------- Важно! --------------------
    // | Эта переменная объявлена глобально и доступна |
    // | всем процессам. В простейшем TBV подходе это  |
    // | допустимо. Как и для mailbox.                 |
    //  ------------------- Важно! --------------------

    int unsigned gen_pkt_am = 100000;

    // Генератор.
    // Данный процесс отвечает за то, КАКИЕ данные
    // будут выставлены на входы тестируемого
    // устройства.

    //  ------------------- Важно! ---------------------
    // | Обратите внимание на ограничения рандомизации. |
    // | Для значений 255 и 0 повышена вероятность ге-  |
    // | нерации. Также числа до 64 в среднем будут ге- |
    // | нерироваться в два раза чаще, чем после 64.    |
    //  ------------------- Важно! ---------------------

    initial begin
        packet_s p;
        repeat(gen_pkt_am) begin
            void'(std::randomize(p) with {
                p.dataa dist {
                          0  :/  1,
                        255  :/  4,
                    [ 1 :64] :/ 16,
                    [65:254] :/  8
                };
                p.datab dist {
                          0  :/  1,
                        255  :/  4,
                    [ 1 :64] :/ 16,
                    [65:254] :/  8
                };
            });
            gen2drv.put(p);
        end
    end

    // Драйвер.
    // Данный процесс отвечает за то, КАК данные
    // попадут в тестируемое устройство.

    //  --------------------- Важно! ----------------------
    // | Обратите внимание на то, что значение сигнала     |
    // | ~clken_i~ определяет драйвер. Это применение      |
    // | концепции разделения обязанностей. Генератор      |
    // | отвечает за то, КАКИЕ данные, а драйвер за то,    |
    // | КАК (КОГДА) отправить эти данные. Таким образом,  |
    // | значения управляющих сигналов определяет драйвер, |
    // | значения полезных данных определяет генератор.    |
    //  --------------------- Важно! ----------------------

    initial begin

        // Переменная пакета.
        packet_s p;

        // Задержка драйвера на выставление
        // активного уровня ~clken_i~ в фронтах
        // тактового сигнала.
        int unsigned drv_delay;

        // Ожидание активного уровня сигнала сброса.
        wait(areset_i === 1'b1);

        // Сброс входных сигналов.
        // Обратите внимание на
        // неблокирующие присваивания.
        clken_i <= 1'b0;
        load_i  <= 1'b0;
        dataa_i <= 8'b0;
        datab_i <= 8'b0;

        // Ожидание неактивного уровня сигнала сброса.
        wait(areset_i === 1'b0);

        // Ожидание первого фронта после сигнала сброса.
        @(posedge clk_i);

        // Получение пакета от генератора и выставление.
        forever begin
            gen2drv.get(p);
            // Рандомизация задержки.
            void'(std::randomize(drv_delay) with {
                drv_delay inside {[0:10]};
            });
            // Ожидание ~drv_delay~ фронтов.
            repeat(drv_delay) begin

                //  ----------- Важно! ------------
                // | Пока ожидаем - не "брезгуем"  |
                // | отправить случайных значений  |
                // | на входы. Без ~clken_i~ они   |
                // | не должны ни на что повлиять. |
                // | Это заявлено в спецификации.  |
                //  ----------- Важно! ------------

                load_i  <= $urandom();
                dataa_i <= $urandom();
                datab_i <= $urandom();
                @(posedge clk_i);
            end
            // Выставление ~clken_i~.
            clken_i <= 1'b1;
            // Выставление данных.
            load_i   <= p.load;
            dataa_i  <= p.dataa;
            datab_i  <= p.datab;
            // Ожидание фронта.
            @(posedge clk_i);
            // Сброс ~clken_i~.
            clken_i <= 1'b0;
        end

    end

    // Монитор.
    // Поток отвечает за сбор информации об изменении
    // значений на портах устройства во времени.

    //  --------------- Важно! ----------------
    // | Обратите внимание, что монитор фор-   |
    // | мирует транзакции только на тех так-  |
    // | тах, когда ~clken_i~ имеет активный   |
    // | уровень, либо имел его на предыдущем  |
    // | такте. Эта техника позволяет снизить  |
    // | нагрузку на симулятор, что при вери-  |
    // | фикации более объемных дизайнов       |
    // | значительно повышает скорость симу-   |
    // | ляции.                                |
    //  --------------- Важно! ----------------

    initial begin

        // Переменная пакета.
        packet_s p;

        // Значение clken_i на предыдущем такте.
        bit clken;

        // Ожидание активного уровня сигнала сброса.
        wait(areset_i === 1'b1);
        // Ожидание неактивного уровня сигнала сброса.
        wait(areset_i === 1'b0);

        // Мониторинг.

        //  -------------- Важно --------------
        // | Процесс мониторинга может до-     |
        // | бавлять дополнительную информацию |
        // | к транзакциям. В данном примере в |
        // | поле транзакции clken сохраня-    |
        // | ется информация о том, какое зна- |
        // | чение было у сигнала ~clken_i~ на |
        // | данном такте.                     |
        //  -------------- Важно --------------

        forever begin
            @(posedge clk_i);
            if( clken_i | clken ) begin
                p.clken = clken_i;
                p.load  = load_i;
                p.dataa = dataa_i;
                p.datab = datab_i;
                p.out   = out_o;
                p.ovfl  = ovfl_o;
                mon2scb.put(p);
                clken = clken_i;
            end
        end

    end

    // Количество проверенных пакетов.

    //  ------------------- Важно! --------------------
    // | Эта переменная объявлена глобально и доступна |
    // | всем процессам. В простейшем TBV подходе это  |
    // | допустимо. Как и для mailbox.                 |
    //  ------------------- Важно! --------------------

    int unsigned scb_pkt_am;

    // Проверка.
    // Данный процесс отвечает за получение информации
    // от монитора и проверки соответствия работы
    // тестируемого устройства спецификации.
    initial begin 

        // Пакет с предыдущего такта ~p_prev~ и пакет с
        // текущего такта ~p_cur~.
        packet_s p_prev, p_cur;

        // Переменная эталонного значения
        bit [16:0] ovfl_out;

        // Результат умножения.
        bit [15:0] mult;

        // Результат суммы.
        bit [16:0] sum;

        // Получаем пакет.
        mon2scb.get(p_prev);
        forever begin
            // Получаем еще 1 пакет.
            // Теперь в переменной ~p_cur~ содержится
            // пакет текущего такта, а в переменной
            // ~p_prev~ пакет с прошлого такта.
            mon2scb.get(p_cur);
            // Далее идет формирование эталонного значения.
            // Шаги формирования помечены *.
            if( p_prev.clken ) begin
                // * Результат умножения.
                mult = p_prev.dataa * p_prev.datab;
                // * Результат суммы. Складываем только
                //   младшие 15 бит выхода, т.к. страший
                //   отвечает за переполнение.
                sum  = ovfl_out[15:0] + mult;
                // * Если была загрузка, то записываем
                //   только результат умножения.
                if( p_prev.load ) begin
                    ovfl_out = {1'b0, mult};
                end
                // * Если нет, то если было переполнение -
                //   сохраняем его флаг и младшие 15 бит.
                //   суммы. Если переполнения не было, то
                //   сохраняем полный результат суммы,
                //   чтобы отследить возможное переполнение.
                else begin
                    if( ovfl_out[16] ) begin
                        ovfl_out = {1'b1, sum[15:0]};
                    end
                    else begin
                        ovfl_out = sum;
                    end
                end
                // Сравниваем эталонное значение со значением
                // со входов текущего такта.
                if( ovfl_out !== {p_cur.ovfl, p_cur.out} ) begin
                    $error("Invalid {ovfl_o, out_o}! Real: %17b ",
                         {p_cur.ovfl, p_cur.out}, "Expected: %17b", ovfl_out);
                end
                // Инкремент счетчика проверенных пакетов.
                scb_pkt_am = scb_pkt_am + 1'b1; 
                // Выходим из бесконечного цикла, если количество
                // проверенных пакетов совпадает с количеством
                // отправленных генератором. Т.е. все предпола-
                // гаемые в рамках данного тестового сценария
                // входные воздействия были проверены.
                if( scb_pkt_am == gen_pkt_am ) break;
            end
            // Текущий пакет становится предыдущим.
            p_prev = p_cur;
        end

        $finish();

    end

endmodule
