/***************************************************
 * Copyright © 2026 Sergey Chusov.
 * Version 1.0.0.
 * Licensed under CC BY-NC-ND 4.0
 * (Attribution-NonCommercial-NoDerivatives).
 * https://creativecommons.org/licenses/by-nc-nd/4.0
 * SPDX-License-Identifier: CC-BY-NC-ND-4.0
 ***************************************************/

`timescale 1ns/1ps

// Топ-модуль верификационного окружения
// модуля MAC (Multiply Accumulate).

//  ----------------- Важно! -------------------
// | Данное окружение реализует TBV метод +     |
// | constrained random подход к верификации.   |
// | Условием завершения является равенство     |
// | количества  проверенных пакетов количеству |
// | сгенерированных пакетов.                   |
//  ----------------- Важно! -------------------

module tb_mac;

    // Параметр для периода тактового
    // сигнала.
    parameter CLK_PERIOD = 10;

    // Определение тактового сигнала и
    // сигнала сброса.
    logic clk_i;
    logic areset_i;

    // Определение проводов, которые будут
    // подключены к портам MAC.
    logic        clken_i;
    logic        load_i;
    logic [ 7:0] dataa_i;
    logic [ 7:0] datab_i;
    logic [15:0] out_o;
    logic        ovfl_o;
    
    // Подключение тестируемого модуля.
    mac DUT (
        .clk_i    ( clk_i    ),
        .areset_i ( areset_i ),
        .clken_i  ( clken_i  ),
        .load_i   ( load_i   ),
        .dataa_i  ( dataa_i  ),
        .datab_i  ( datab_i  ),
        .out_o    ( out_o    ),
        .ovfl_o   ( ovfl_o   )
    );

    // Генерация тактового сигнала.
    initial begin
        clk_i <= 1'b0;
        forever begin
            #(CLK_PERIOD/2) clk_i = ~clk_i;
        end
    end

    // Генерация сигнала сброса.
    initial begin
        areset_i <= 1'b1;
        @(posedge clk_i);
        @(negedge clk_i);
        areset_i = 1'b0;
    end

    // Структура, которая будет передаваться
    // между компонентами окружения. Будет служить
    // "контейнером" для отправки данных между
    // генератором и драйвером, а также между
    // монитором и проверкой.
    typedef struct {
             logic        clken;
        rand logic        load;
        rand logic [ 7:0] dataa;
        rand logic [ 7:0] datab;
        rand logic [15:0] out;
        rand logic        ovfl;
    } packet_s;
    
    //  ------------------- TODO ---------------------
    // | Создайте mailbox'ы между генератором и драй- |
    // | вером, а также между монитором и проверкой.  |
    // | Назовите их ~gen2drv~ и ~mon2scb~ соответ-   |
    // | ственно. Символы ~ обрамляют имена перемен-  |
    // | ных и используются для обозначения частей    |
    // | кода. Не пишите их.                          |
    //  ------------------- TODO ---------------------

    //  ------------------- TODO ---------------------
    // | Ограничьте размер ~gen2drv~ одним элементом. |
    //  ------------------- TODO ---------------------

    // Количество пакетов, которые отправит генератор в
    // драйвер. Переменная используется двумя потоками:
    // генератором и проверкой.

    //  ------------------- Важно! --------------------
    // | Эта переменная объявлена глобально и доступна |
    // | всем процессам. В простейшем TBV подходе это  |
    // | допустимо. Как и для mailbox.                 |
    //  ------------------- Важно! --------------------

    int unsigned gen_pkt_am = 100000;

    // Генератор.
    // Данный процесс отвечает за то, КАКИЕ данные
    // будут выставлены на входы тестируемого
    // устройства.

    //  ------------------- Важно! ---------------------
    // | Обратите внимание на ограничения рандомизации. |
    // | Для значений 255 и 0 повышена вероятность ге-  |
    // | нерации. Также числа до 64 в среднем будут ге- |
    // | нерироваться в два раза чаще, чем после 64.    |
    //  ------------------- Важно! ---------------------

    initial begin
        packet_s p;
        repeat(gen_pkt_am) begin
            void'(std::randomize(p) with {
                p.dataa dist {
                          0  :/  1,
                        255  :/  4,
                    [ 1 :64] :/ 16,
                    [65:254] :/  8
                };
                p.datab dist {
                          0  :/  1,
                        255  :/  4,
                    [ 1 :64] :/ 16,
                    [65:254] :/  8
                };
            });
            gen2drv.put(p);
        end
    end

    // Драйвер.
    // Данный процесс отвечает за то, КАК данные
    // попадут в тестируемое устройство.

    //  --------------------- Важно! ----------------------
    // | Обратите внимание на то, что значение сигнала     |
    // | ~clken_i~ определяет драйвер. Это применение      |
    // | концепции разделения обязанностей. Генератор      |
    // | отвечает за то, КАКИЕ данные, а драйвер за то,    |
    // | КАК (КОГДА) отправить эти данные. Таким образом,  |
    // | значения управляющих сигналов определяет драйвер, |
    // | значения полезных данных определяет генератор.    |
    //  --------------------- Важно! ----------------------

    initial begin

        // Переменная пакета.
        packet_s p;

        // Задержка драйвера на выставление
        // активного уровня ~clken_i~ в фронтах
        // тактового сигнала.
        int unsigned drv_delay;

        // Ожидание активного уровня сигнала сброса.
        wait(areset_i === 1'b1);

        //  ------------------- TODO ---------------------
        // | Сбросьте входные сигналы в начальное состоя- |
        // | ние.                                         |
        //  ------------------- TODO ---------------------

        // Ожидание неактивного уровня сигнала сброса.
        wait(areset_i === 1'b0);

        // Ожидание первого фронта после сигнала сброса.
        @(posedge clk_i);

        // Получение пакета от генератора и выставление.
        forever begin
            gen2drv.get(p);

            //  ------------------- TODO ---------------------
            // | При помощи std::randomize() рандомизируйте   |
            // | ~drv_delay~. Используйте with, чтобы не по-  |
            // | лучить чрезмерную задержку.                  |
            //  ------------------- TODO ---------------------

            // Ожидание ~drv_delay~ фронтов.
            repeat(drv_delay) begin

                //  ----------- Важно! ------------
                // | Пока ожидаем - не "брезгуем"  |
                // | отправить случайных значений  |
                // | на входы. Без ~clken_i~ они   |
                // | не должны ни на что повлиять. |
                // | Это заявлено в спецификации.  |
                //  ----------- Важно! ------------

                load_i  <= $urandom();
                dataa_i <= $urandom();
                datab_i <= $urandom();
                @(posedge clk_i);
            end

            //  ------------------- TODO ---------------------
            // | Подайте входные данные из полученного паке-  |
            // | та. Не забудьте про ~clken_i~.               |
            //  ------------------- TODO ---------------------

        end

    end

    // Монитор.
    // Поток отвечает за сбор информации об изменении
    // значений на портах устройства во времени.

    //  --------------- Важно! ----------------
    // | Обратите внимание, что монитор фор-   |
    // | мирует транзакции только на тех так-  |
    // | тах, когда ~clken_i~ имеет активный   |
    // | уровень, либо имел его на предыдущем  |
    // | такте. Эта техника позволяет снизить  |
    // | нагрузку на симулятор, что при вери-  |
    // | фикации более объемных дизайнов       |
    // | значительно повышает скорость симу-   |
    // | ляции.                                |
    //  --------------- Важно! ----------------

    initial begin

        // Переменная пакета.
        packet_s p;

        // Значение clken_i на предыдущем такте.
        bit clken;

        // Ожидание активного уровня сигнала сброса.
        wait(areset_i === 1'b1);
        // Ожидание неактивного уровня сигнала сброса.
        wait(areset_i === 1'b0);

        // Мониторинг.

        //  -------------- Важно --------------
        // | Процесс мониторинга может до-     |
        // | бавлять дополнительную информацию |
        // | к транзакциям. В данном примере в |
        // | поле транзакции clken сохраня-    |
        // | ется информация о том, какое зна- |
        // | чение было у сигнала ~clken_i~ на |
        // | данном такте.                     |
        //  -------------- Важно --------------

        forever begin
            
            //  ------------------- TODO ---------------------
            // | Реализуйте мониторинг данных и их отправку в |
            // | mailbox.                                     |
            //  ------------------- TODO ---------------------
            
        end

    end

    // Количество проверенных пакетов.

    //  ------------------- Важно! --------------------
    // | Эта переменная объявлена глобально и доступна |
    // | всем процессам. В простейшем TBV подходе это  |
    // | допустимо. Как и для mailbox.                 |
    //  ------------------- Важно! --------------------

    int unsigned scb_pkt_am;

    // Проверка.
    // Данный процесс отвечает за получение информации
    // от монитора и проверки соответствия работы
    // тестируемого устройства спецификации.
    initial begin 

        // Пакет с предыдущего такта ~p_prev~ и пакет с
        // текущего такта ~p_cur~.
        packet_s p_prev, p_cur;

        // Переменная эталонного значения
        bit [16:0] ovfl_out;

        // Результат умножения.
        bit [15:0] mult;

        // Результат суммы.
        bit [16:0] sum;

        // Получаем пакет.
        mon2scb.get(p_prev);
        forever begin
            // Получаем еще 1 пакет.
            // Теперь в переменной ~p_cur~ содержится
            // пакет текущего такта, а в переменной
            // ~p_prev~ пакет с прошлого такта.
            mon2scb.get(p_cur);

            //  ------------------- TODO ---------------------
            // | Реализуйте проверку, инкремент счетчика про- |
            // | веренных пакетов и условие выхода из цикла.  |
            //  ------------------- TODO ---------------------

            // Текущий пакет становится предыдущим.
            p_prev = p_cur;
        end

        $finish();

    end

endmodule
