/***************************************************
 * Copyright © 2026 Sergey Chusov.
 * Version 1.0.0.
 * Licensed under CC BY-NC-ND 4.0
 * (Attribution-NonCommercial-NoDerivatives).
 * https://creativecommons.org/licenses/by-nc-nd/4.0
 * SPDX-License-Identifier: CC-BY-NC-ND-4.0
 ***************************************************/

`timescale 1ns/1ps

// Топ-модуль верификационного окружения
// последовательностного сумматора.

//  --------------------- Важно! --------------------
// | Данный модуль НЕ является эталонным примером    |
// | верификационного окружения для последователь-   |
// | ностной логики. Он показывает несостоятельность |
// | применимости подхода, используемого для комби-  |
// | национной логики, для верификации последова-    |
// | тельностной логики. Сложности появляются в мо-  |
// | мент генерации воздействий для следующего такта |
// | в тот момент времени, когда производится про-   |
// | верка выходных значений для входных воздействий |
// | с предыдущего такта. Визуально нарушается под-  |
// | ход: генерация -> ожидание -> проверка. Код     |
// | становится сложно воспринимать, отлаживать.     |
//  --------------------- Важно! --------------------

module tb_fulladder_sync;

    // Параметр для периода тактового
    // сигнала.
    parameter CLK_PERIOD = 10;

    // Определение тактового сигнала и
    // сигнала сброса.
    // В большинстве случаев названия
    // этих проводов дублируют названия
    // тактового сигнала и сигнала сброса
    // тестируемого устройства.
    logic clk_i;
    logic areset_i;

    // Определение проводов, которые будут
    // подключены к портам сумматора.
    // В большинстве случаев названия
    // этих проводов дублируют названия
    // портов.
    logic A_i;
    logic B_i;
    logic Cin_i;
    logic Cout_o;
    logic S_o;
    
    // Подключение тестируемого модуля.
    fulladder_sync DUT (
        .clk_i    ( clk_i    ),
        .areset_i ( areset_i ),
        .A_i      ( A_i      ),
        .B_i      ( B_i      ),
        .Cin_i    ( Cin_i    ),
        .Cout_o   ( Cout_o   ),
        .S_o      ( S_o      )
    );

    // Генерация тактового сигнала.
    initial begin
        clk_i <= 1'b0;
        forever begin
            #(CLK_PERIOD/2) clk_i = ~clk_i;
        end
    end

    // Генерация сигнала сброса.
    initial begin
        areset_i <= 1'b1;
        @(posedge clk_i);
        @(negedge clk_i);
        areset_i = 1'b0;
    end

    // Генерируем входные воздействия, ожидаем.
    initial begin

        // Ожидание активного уровня сигнала сброса.
        wait(areset_i === 1'b1);

        // Сброс входных сигналов.
        // Обратите внимание на
        // неблокирующие присваивания.
        A_i   <= 1'b0;
        B_i   <= 1'b0;
        Cin_i <= 1'b0;

        // Ожидание неактивного уровня сигнала сброса.
        wait(areset_i === 1'b0);

        // Ожидание фронта тактового сигнала.
        @(posedge clk_i);

        //  -------------------- Важно! --------------------
        // | Стрелками показан путь от генерации входных    |
        // | воздействий до проверки результата для данных  |
        // | входных воздействий.                           |
        //  -------------------- Важно! --------------------

        // Входные сигналы. -----------------------------------------------------
        A_i   <= 1'b0;                                                        // | 
        B_i   <= 1'b1;                                                        // | 
        Cin_i <= 1'b1;                                                        // | 
                                                                              // | 
        // Ожидание фронта тактового сигнала.                                 // | 
        @(posedge clk_i);                                                     // | 
                                                                              // | 
        // Входные сигналы.                                                   // | 
        A_i   <= 1'b1;                                                        // | 
        B_i   <= 1'b0;                                                        // | 
        Cin_i <= 1'b0;                                                        // | 
                                                                              // | 
        // Ожидание фронта тактового сигнала.                                 // | 
        @(posedge clk_i);                                                     // | 
                                                                              // | 
        // Проверка для вектора {A_i, B_i, Cin_i}: 011. <------------------------ 
        if( Cout_o !== 1'b1 ) begin
            $error("Invalid Cout_o! Real: %1b, Expected: %1b", Cout_o, 1'b1);
        end
        if( S_o !== 1'b0 ) begin
            $error("Invalid S_o! Real: %1b, Expected: %1b", S_o, 1'b0);
        end

        // Входные сигналы. -----------------------------------------------------
        A_i   <= 1'b1;                                                        // |
        B_i   <= 1'b1;                                                        // |
        Cin_i <= 1'b1;                                                        // |
                                                                              // |
        // Ожидание фронта тактового сигнала.                                 // |
        @(posedge clk_i);                                                     // |
                                                                              // |
        // Проверка для вектора {A_i, B_i, Cin_i}: 100.                       // |
        if( Cout_o !== 1'b0 ) begin                                           // |
            $error("Invalid Cout_o! Real: %1b, Expected: %1b", Cout_o, 1'b0); // |
        end                                                                   // |
        if( S_o !== 1'b1 ) begin                                              // |
            $error("Invalid S_o! Real: %1b, Expected: %1b", S_o, 1'b1);       // |
        end                                                                   // |
                                                                              // |
        // Ожидание фронта тактового  сигнала.                                // |
        @(posedge clk_i);                                                     // |
                                                                              // |
        // Проверка для вектора {A_i, B_i, Cin_i}: 111. <------------------------|
        if( Cout_o !== 1'b1 ) begin
            $error("Invalid Cout_o! Real: %1b, Expected: %1b", Cout_o, 1'b1);
        end
        if( S_o !== 1'b1 ) begin
            $error("Invalid S_o! Real: %1b, Expected: %1b", S_o, 1'b1);
        end

        // Завершение.
        $finish();

    end

endmodule
