/***************************************************
 * Copyright © 2026 Sergey Chusov.
 * Version 1.0.0.
 * Licensed under CC BY-NC-ND 4.0
 * (Attribution-NonCommercial-NoDerivatives).
 * https://creativecommons.org/licenses/by-nc-nd/4.0
 * SPDX-License-Identifier: CC-BY-NC-ND-4.0
 ***************************************************/

`timescale 1ns/1ps

// Модуль показательного тестирования
// стабильности рандомизации SystemVerilog.

//  ----------------- Важно! --------------------
// | Модуль инициализируется "корневым" зерном", |
// | которое  в большинстве симуляторов задается |
// | из командной строки.                        |
//  ----------------- Важно! --------------------

                            // -> Инициализация процессов. -----
module tb_random_stability; // -------------------------------  |
                                                           // | V
    // Переменные для рандомизации.                        // | И
    bit [7:0] a, b;                                        // | н
    bit [7:0] c, d;                                        // | и
                                                           // | ц
    //  ----------------- Важно! ---------------------     // | и
    // | Каждый статический процесс инициализируется  |    // | а
    // | собственным зерном в детерменированном       |    // | л
    // | порядке. Раздел стандарта 18.14.1 гласит,    |    // | и
    // | что для того, чтобы "сохранить" стабильность |    // | з
    // | рандомизации, новые процессы могут быть до-  |    // | а
    // | бавлены в конец уже существующего блока кода.|    // | ц
    // | Это значит, что симулятор должен инициализи- |    // | я
    // | ровать статические процессы сверху вниз!     |    // | 
    //  ----------------- Важно! ---------------------     // | п
                                                           // | р
    // Нулевой статический процесс рандомизации. <-----0----- | о
    initial begin                                          // | ц
        repeat(5) begin                                    // | е
            c = $urandom();                                // | с
            d = $urandom();                                // | с
            #10;                                           // | о
        end                                                // | в
    end                                                    // | 
                                                           // | 
    // Первый статический процесс инициализации. <-----1------
    initial begin  
        repeat(5) begin                                         
            b = $urandom();                                     
            a = $urandom();                                     
            #10;
        end                                            
    end                                                    

    //  ----------------- Важно! -------------------
    // | Попробуйте переставить местами статические |
    // | процессы. Сможете ли предсказать результат |
    // | рандомизации переменных (с учетом одного и |
    // | того же "корневого" зерна)?                |
    //  ----------------- Важно! -------------------

endmodule
